#pragma once

// SHANKS ENGINE  (3.8.1) SDKGen by Telegram @O_N_E_B_I_E_C_E 
//Ch @onebiecerr 
// Generate on Wed May  7 13:15:43 2025
 
namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CollectItemCfg_type.BP_STRUCT_CollectItemCfg_type
// 0x0014
struct FBP_STRUCT_CollectItemCfg_type
{
	int                                                BWear_0_77765300395741962A4D15250F869F62;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_1_711E02006F631D4E62A252C3044EF8C4;                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Sort_2_3B0288C00CE6570B0BEDEFD40EF992D4;                  // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ThemeID_3_060FFEC02EBCB85F076135840BB0D644;               // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                OneID_4_2CFC2A807955D42620CD9FDB0F950D34;                 // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

